<!-- dflook/terraform-github-actions {"workspace":"dev-dev-deploy","backend_type":"remote","backend":"0dd52039d936a7e1d5025a8a4d08a2edb19c1f8a40406c06dd09dde4084f97a6","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #55 at https://github.com/scidsg/hushline/actions/runs/9721298831","plan_out_hash":"c536d224da84ffe37bcbcfaebf731ea664843ba8417511e167d14cbd5adf326a","plan_hash":"a635e33bb6eaf4cbd4837377fb9cc037040240a22bd19648ca97b8999cbb48bc","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __dev-dev-deploy__ workspace<details open><summary>With variables</summary>

```hcl
branch = "dev-deploy"
name   = "hushline-dev-deploy"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = "************************************"
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains = (known after apply)
+           name    = "hushline-dev-deploy"
+           region  = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "hushline"
+               run_command        = (known after apply)

+               github {
+                   branch         = "dev-deploy"
+                   deploy_on_push = true
+                   repo           = "scisdg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #55](https://github.com/scidsg/hushline/actions/runs/9721298831)